{
  "941": "Unspecified ASA channel.",
  "800": "Invalid biometric data.",
  "940": "Unauthorized ASA channel.",
  "330": "Biometrics locked by Aadhaar holder.",
  "530": "Invalid authenticator code.",
  "740": "Missing OTP data as specified in Uses",
  "200": "Pa (address) attributes of demographic data did not match.",
  "930": "Technical error that are internal to authentication server.",
  "931": "Technical error that are internal to authentication server.",
  "932": "Technical error that are internal to authentication server.",
  "933": "Technical error that are internal to authentication server.",
  "934": "Technical error that are internal to authentication server.",
  "935": "Technical error that are internal to authentication server.",
  "936": "Technical error that are internal to authentication server.",
  "937": "Technical error that are internal to authentication server.",
  "938": "Technical error that are internal to authentication server.",
  "939": "Technical error that are internal to authentication server.",
  "540": "Invalid Auth XML version.",
  "542": "AUA not authorized for ASA. This error will be returned if AUA and ASA do not have linking in the portal.",
  "541": "Invalid PID XML version.",
  "543": "Sub-AUA not associated with AUA. This error will be returned if Sub-AUA specified in sa attribute is not added as Sub-AUA in portal.",
  "400": "Invalid OTP value.",
  "402": "txn value did not match with txn value used in Request OTP API.",
  "730": "Missing PIN data as specified in Uses",
  "822": "Invalid value in the bs attribute of Bio element within Pid.",
  "316": "Number of FID should not exceed 1.",
  "314": "Number of FMR\/FIR should not exceed 10.",
  "315": "Number of IIR should not exceed 2.",
  "312": "FMR and FIR cannot be used in same transaction.",
  "313": "Single FIR record contains more than one finger.",
  "310": "Duplicate fingers used.",
  "820": "Missing or empty value for bt attribute in Uses element.",
  "311": "Duplicate Irises used.",
  "821": "Invalid value in the bt attribute of Uses element.",
  "512": "Invalid Aadhaar holder consent in rc attribute of Auth",
  "511": "Invalid PID XML format.",
  "510": "Invalid Auth XML format.",
  "721": "Missing Pfa data as specified in Uses",
  "720": "Missing Pa data as specified in Uses",
  "100": "Pi (basic) attributes of demographic data did not match.",
  "811": "Missing biometric data in CIDR for the given Aadhaar number.",
  "812": "Aadhaar holder has not done Best Finger Detection. Application should initiate BFD to help Aadhaar holder identify their best fingers.",
  "910": "Invalid mv value in the Pi element.",
  "911": "Invalid mv value in the Pfa element.",
  "912": "Invalid ms value.",
  "810": "Missing biometric data as specified in Uses",
  "913": "Both Pa and Pfa are present in the authentication request (Pa and Pfa are mutually exclusive).",
  "996": "Aadhaar cancelled (Aadhaar is no in authenticable status).",
  "521": "Invalid dc code under Meta tag.",
  "997": "Aadhaar suspended (Aadhaar is not in authenticable status).",
  "524": "Invalid mi code under Meta tag.",
  "995": "Aadhaar suspended by competent authority.",
  "520": "Invalid tid value.",
  "710": "Missing  Pi data as specified in Uses",
  "590": "Public device not allowed as per license.",
  "998": "Invalid Aadhaar Number.",
  "527": "Invalid mc code under Meta tag.",
  "999": " Unknown error.",
  "571": "PIN requires reset.",
  "570": "Invalid key info in digital signature (this means that certificate used for signing the authentication request is not valid – it is either expired, or does not belong to the AUA or is not created by a well-known Certification Authority).",
  "980": "Unsupported option.",
  "574": "Pa usage not allowed as per license.",
  "575": "Pfa usage not allowed as per license.",
  "572": "Invalid biometric position.",
  "573": "Pi usage not allowed as per license.",
  "578": " IIR usage not allowed as per license.",
  "579": "OTP usage not allowed as per license.",
  "576": "FMR usage not allowed as per license.",
  "577": "FIR usage not allowed as per license.",
  "505": "Synchronized Key usage not allowed for the AUA.",
  "300": "Biometric data did not match.",
  "503": "Invalid encryption of Hmac.",
  "504": "Session key re-initiation required due to expiry or key out of sync.",
  "580": "PIN usage not allowed as per license.",
  "582": "Local language usage not allowed as per license.",
  "581": "Fuzzy matching usage not allowed as per license.",
  "501": "Invalid certificate identifier in ci attribute of Skey.",
  "502": "Invalid encryption of PID.",
  "500": "Invalid encryption of session key.",
  "586": "FID usage not allowed as per license. This feature is being implemented in a phased manner.",
  "587": "Name space not allowed.",
  "588": "Registered device not allowed as per license.",
  "558": "Invalid dih",
  "559": "Device Certificate has expired",
  "556": "rdsVer is invalid and not part of certification registry.",
  "557": "dpId is invalid and not part of certification registry.",
  "554": "Public devices are not allowed to be used.",
  "555": "rdsId is invalid and not part of certification registry.",
  "553": "Registered devices currently not supported. This feature is being implemented in a phased manner.",
  "550": "Invalid Uses element attributes.",
  "551": "Invalid tid value.",
  "560": "DP Master Certificate has expired",
  "951": "Biometric lock related technical error.",
  "950": "OTP store related technical error.",
  "569": "Digital signature verification failed (means that authentication request XML was modified after it was signed).",
  "565": "AUA license has expired.",
  "566": "Invalid non-decryptable license key.",
  "567": "Invalid input(this error occurs when unsupported characters were found in Indian language values, lname or lav).",
  "568": "Unsupported Language.",
  "561": "DP Master Certificate has expired",
  "562": "Request expired (Pid->ts value is older than N hours where N is a configured threshold in authentication server).",
  "563": "Duplicate request (this error occurs when exactly same authentication request was re-sent by AUA).",
  "902": "Invalid dob value in the Pi element (this corresponds to a scenarios wherein dob attribute is not of the format YYYY or YYYY-MM-DD, or the age is not in valid range).",
  "564": "HMAC Validation failed.",
  "901": "No authentication data found in the request (this corresponds to a scenario wherein none of the auth data – Demo, Pv, or Bios – is present)."
}